server_stuffs/todoserver/app/views/users/show.html.erb

<h2>Groups</h2>
<% @user.groups.each do |group| %>
---
SELECT * FROM "groups" INNER JOIN "groups_users" ON "groups".id = "groups_users".group_id WHERE ("groups_users".user_id = 5 )

<h2>Invitations recv</h2>
<% @user.recv_invitations.each do |inv| %>
---
SELECT "sent_invitations".* FROM "sent_invitations" WHERE ("sent_invitations".user_id = 5)