server_stuffs/todoserver/app/controllers/entries_controller.rb

  def create
    @entry = Entry.new(params[:entry])

    respond_to do |format|
      if @entry.save
---
INSERT INTO "entries" ("group", "todo", "created_at", "updated_at", "user") VALUES ('two', 'twoTodo', '2011-04-19 03:27:23.877919', '2011-04-19 03:27:23.877919', NULL)