server_stuffs/todoserver/app/controllers/groups_controller.rb

  def index
    if params[:user_id].nil? == false:
      @groups = User.find(params[:user_id]).groups

      respond_to do |format|
        format.html # index.html.erb
        format.xml  { render :xml => @groups }
        format.json  { render :json => @groups }
      end
    else
      @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def create
    @user = User.find(params[:user_id])
    @group = @user.groups.create(:name => params[:group][:name], :description => params[:group][:description])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
INSERT INTO "groups" ("name", "created_at", "updated_at", "description") VALUES ('group1', '2011-04-30 23:31:40.243943', '2011-04-30 23:31:40.243943', 'test')
SELECT "groups"."id" FROM "groups" WHERE "groups"."id" IS NULL AND ("groups"."name" = 'group2') LIMIT 1

  def destroy
    @group = Group.find(params[:id])
    @group.destroy
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 29 LIMIT 1
DELETE FROM "groups" WHERE "groups"."id" = 29