server_stuffs/todoserver/app/controllers/recv_invitations_controller.rb

  def accept
    @user = User.find(params[:user_id])
    if @user.nil?
      error.add "User doesn't exist"
    end

    @invitation = @user.recv_invitations.find(params[:inv_id])

    @sender_inv = User.find_by_name(@invitation.from).sent_invitations
    @sender_inv.find_by_to(@user.name).update_attributes(:status => "Accepted")

    @group = Group.find_by_name(@invitation.group)
    @user.groups << @group

    @user.recv_invitations.delete(@invitation)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 7 LIMIT 1
SELECT "recv_invitations".* FROM "recv_invitations" WHERE "recv_invitations"."id" = 21 AND ("recv_invitations".user_id = 7) LIMIT 1
SELECT "users"."id" FROM "users" WHERE "users"."id" = 5 AND ("users"."name" = 'user1') AND ("users".id <> 5) LIMIT 1
SELECT "sent_invitations".* FROM "sent_invitations" WHERE "sent_invitations"."to" = 'user2' AND ("sent_invitations".user_id = 5) LIMIT 1
UPDATE "sent_invitations" SET "updated_at" = '2011-05-03 23:37:19.096405', "status" = 'accepted' WHERE "sent_invitations"."id" = 19
SELECT "groups"."id" FROM "groups" WHERE "groups"."id" IS NULL AND ("groups"."name" = 'group1') LIMIT 1
INSERT INTO "groups" ("description", "updated_at", "created_at", "name") VALUES (NULL, '2011-05-03 23:20:07.798185', '2011-05-03 23:20:07.798185', 'group1')
DELETE FROM "recv_invitations" WHERE "recv_invitations"."id" = 22

  def reject
    @user = User.find(params[:user_id])
    if @user.nil?
      error.add "User doesn't exist"
    end

    @invitation = @user.recv_invitations.find(params[:inv_id])
    @sender_inv = User.find_by_name(@invitation.from).sent_invitations
    @sender_inv.find_by_to(@user.name).update_attributes(:status => "Rejected")

    @user.recv_invitations.delete(@invitation)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 7 LIMIT 1
SELECT "recv_invitations".* FROM "recv_invitations" WHERE "recv_invitations"."id" = 26 AND ("recv_invitations".user_id = 7) LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."name" = 'user1' LIMIT 1
SELECT "sent_invitations".* FROM "sent_invitations" WHERE "sent_invitations"."to" = 'user2' AND ("sent_invitations".user_id = 5) LIMIT 1
UPDATE "sent_invitations" SET "updated_at" = '2011-05-04 05:23:57.649769', "status" = 'rejected' WHERE "sent_invitations"."id" = 21
DELETE FROM "recv_invitations" WHERE "recv_invitations"."id" = 26