server_stuffs/todoserver/app/controllers/sent_invitations_controller.rb

  def create
    @sender = User.find(params[:user_id])

    if params[:sent_invitation].nil?:
      @receiver = User.find_by_name(params[:recipient])

      @receiver.recv_invitations.create(:group => params[:group], :description => params[:description], :sender => @sender.name)
      @created_inv = @sender.sent_invitations.create(:group => params[:group], :description => params[:description], :recipient => @receiver.name, :status => "Pending" )
    else
      @receiver = User.find_by_name(params[:sent_invitation][:recipient])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 5 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."name" = 'user2' LIMIT 1
INSERT INTO "sent_invitations" ("user_id", "group", "created_at", "updated_at", "description", "status", "to") VALUES (12, 'group1', '2011-05-04 06:13:23.329501', '2011-05-04 06:13:23.329501', '', 'Pending', 'user2')
SELECT "groups".* FROM "groups" WHERE "groups"."name" = 'group1' LIMIT 1

  def destroy
    @user = User.find(params[:user_id])
    @sent_inv = @user.sent_invitations.find(params[:id])

    @sent_inv.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1
SELECT "sent_invitations".* FROM "sent_invitations" WHERE "sent_invitations"."id" = 22 AND ("sent_invitations".user_id = 9) LIMIT 1
DELETE FROM "sent_invitations" WHERE "sent_invitations"."id" = 22