server_stuffs/todoserver/app/controllers/tododetails_controller.rb

SELECT "tododetails".* FROM "tododetails"
---
  def index
    @tododetails = Tododetail.all

SELECT "tododetails".* FROM "tododetails" WHERE "tododetails"."todo" = '1' LIMIT 1
---
  def show
    @tododetail = Tododetail.find(params[:id])

SELECT "tododetails".* FROM "tododetails" WHERE "tododetails"."id" = 1 LIMIT 1
---
  def edit
    @tododetail = Tododetail.find(params[:id])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 32 LIMIT 1
INSERT INTO "tododetails" ("place", "note", "updated_at", "status", "group", "todo", "tag", "delivered", "created_at") VALUES ('Main Stacks', '', '2011-04-28 04:21:50.830263', '', '', 'it''s working da?', '', '', '2011-04-28 04:21:50.830263')
---
  def create
    @group = Group.find(params[:group_id])
    @tododetail = @group.tododetails.create(params[:tododetail])

SELECT "tododetails".* FROM "tododetails" WHERE "tododetails"."id" = 1 LIMIT 1
UPDATE "tododetails" SET "updated_at" = '2011-04-28 04:37:54.319299', "status" = 'In Progress', "group" = 'Group 3', "todo" = 'test2' WHERE "tododetails"."id" = 1
---
  def update
    @tododetail = Tododetail.find(params[:id])

    respond_to do |format|
      if @tododetail.update_attributes(params[:tododetail])

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 32 LIMIT 1
SELECT "tododetails".* FROM "tododetails" WHERE "tododetails"."id" = 6 AND ("tododetails".group_id = 32) LIMIT 1
DELETE FROM "tododetails" WHERE "tododetails"."id" = 6
---
  def destroy
    @group = Group.find(params[:group_id])
    @tododetail = @group.tododetails.find(params[:id])
    @tododetail.destroy