server_stuffs/todoserver/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("updated_at", "name", "created_at") VALUES ('2011-05-04 04:48:29.193706', 'user1', '2011-05-04 04:48:29.193706')

  def unsubscribe
    @user = User.find_by_name(params[:user_name])
    @group = @user.groups.find_by_name(params[:group_name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'user2' LIMIT 1
SELECT "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups".id = "groups_users".group_id WHERE "groups"."name" = 'group1' AND ("groups_users".user_id = 7 ) LIMIT 1