server_stuffs/todoserver/app/views/groups/show.html.erb

<h2>Users</h2>
<% @group.users.each do |user| %>
---
SELECT * FROM "users" INNER JOIN "groups_users" ON "users".id = "groups_users".user_id WHERE ("groups_users".group_id = 32 )

<h2>Todos</h2>
<% @group.tododetails.each do |todo| %>
---
SELECT "tododetails".* FROM "tododetails" WHERE ("tododetails".group_id = 32)

  <p>
    <%= link_to 'Delete todo', [todo.group, todo],
                 :confirm => 'Are you sure?',
                 :method => :delete %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = 32 LIMIT 1